org/blog/Emacs_Lisp/basics.org
#+title: Emacs Lisp - Basics
#+date: <2022-05-18 Wed>
#+author: Morgan Walsh
#+description: Some notes from researching Elisp
#+keywords: emacs elisp lisp
#+subtitle: Some notes from researching Elisp

** Sources

- [[https://benwindsorcode.github.io/Getting-Started-With-Emacs-Lisp/][Getting Started With Emacs Lisp Hands On - A Practical Beginners Tutorial (#1)]]
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/List-Processing.html#List-Processing][List Processing - GNU (#2)]]
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Writing-Defuns.html#Writing-Defuns][How To Write Function Definitions (#3)]]
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Practicing-Evaluation.html#Practicing-Evaluation][Practicing Evaluation (#4)]] - Getting and switching buffers
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/car-cdr-_0026-cons.html#car-cdr-_0026-cons][Fundamental Functions (#5)]] - List operations
- [[https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html#Loops-_0026-Recursion][Loops and Recursion (#6)]]
- [[https://www.masteringemacs.org/article/mastering-key-bindings-emacs][Mastering Key Bindings in Emacs (#7)]]

** Notes from source #1

Emacs Lisp is a programming language used for interacting, customising and extending Emacs functionality.

--------------------------------

*** Running Elisp in a buffer

In empty buffers, Elisp can be written and executed by placing the cursor over the end of a line and typing ~C-x C-e~:

#+caption: Adding two numbers with reverse polish notation
#+name: add-two-numbers
#+begin_src elisp :results value :exports both :eval yes
  (+ 2 2)
#+end_src

This will result in:

#+results: add-two-numbers

ELisp, and other Lisp dialects, often use Reverse Polish Notation (RPN) where the operator is specified before the operands rather than between.

Functions can also be called by surrounding them with parenthesis and making them the first element:

#+caption: The describe-bindings function
#+name: call-describe-bindings
#+begin_src elisp :exports code :eval no
  (describe-bindings)
#+end_src

The ~describe-bindings~ function outputs a help buffer with a list of key bindings.

- Note: If in a org file, run with ~C-c C-c~ instead

*** Flow control (if statement)

The if/else statement has the following structure:

#+caption if-else statement example
#+begin_src elisp :exports code :eval no
  (if (condition)
      (execute if true)
      (execute if false))
#+end_src

*** Get current line number

Use ~what-line~ to get the line number of the cursors position:

#+caption what-line examples
#+name: what-line-example
#+begin_src elisp :results output :exports both :eval yes
  (if (eq (what-line) "Line 1")
      (princ "Is line 1")
      (princ "Not line 1"))
#+end_src

The output of this is as follows:

#+RESULTS: what-line-example
: Not line 1

The ~princ~ function will print a string to standard output, the ~eq~ function returns true if two inputs are equal, false otherwise.

*** Writing functions

The ~defun~ keyword is used to define a function:

#+caption function declaration example
#+begin_src elisp :exports code :eval no
  (defun function-name (parameter1 parameter2 etc...)
      (body))
#+end_src

The code to execute is placed in the body, inputs are passed as parameters.

The following example is a function definition for adding two numbers:

#+caption A function to add two numbers
#+name: add-two-numbers
#+begin_src elisp :results silent :exports code :eval yes :session basics
  (defun add-numbers (num1 num2)
      (+ num1 num2))
#+end_src

This can then be invoked like so:

#+caption Invoking the add-numbers function
#+name: invoke-add-two-numbers
#+begin_src elisp :results value :exports both :eval yes :session basics
  (add-numbers 3 2)
#+end_src

This outputs the result:

#+results: invoke-add-two-numbers
: 5

*** Interacting with emacs

**** Moving around the buffer

The ~search-forward~ function accepts a string to search for in some text, this will jump the cursor to the line with the first match on it, ~search-backward does the reverse.

#+begin_src elisp :results silent :exports code :eval no-export
  (search-forward "hello")
  some text
  hello
#+end_src

The ~goto-char~ function accepts a character number to jump the cursor to:

#+begin_src elisp :results silent :exports code :eval no-export
  (goto-char 0)
#+end_src

Pass the ~point-max~ function to get the number of the last character in the document and jump to it:

#+begin_src elisp :results silent :exports code :eval no-export
  (goto-char (point-max))
#+end_src

Use ~point-min~ for the first character:

#+begin_src elisp :results silent :exports code :eval no-export
  (goto-char (point-min))
#+end_src

The ~next-line~ and ~previous-line~ functions are used for moving the cursor forwards or backwards one line respectively.

**** Inserting text

Insert text into a buffer with the ~insert~ function followed by either:

- a string
- a set of space separated strings and string variables

Inserting text looks as follows:

#+name: insert-text
#+begin_src elisp :results silent :exports code :eval no-export
  (next-line)
  (next-line)
  (insert "This text was inserted :D")
#+end_src

#+call: insert-text()


**** Moving the cursor back to where it started

After moving the cursor, it is often desirable to return it to where it started. The ~save-excursion~ function can be used to wrap Elisp statements that may modify the cursors position and return it to its original position:

#+begin_src elisp :results silent :exports code :eval no-export
  (save-excursion
      (previous-line)
      (insert "Inserted this above ya")) 
#+end_src

