blog/Emacs_Lisp/basics.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-19 Thu 23:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs Lisp - Basics</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="Some notes from researching Elisp"
>
<meta name="keywords" content="emacs elisp lisp">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Emacs Lisp - Basics</h1>
<p class="subtitle">Some notes from researching Elisp</p>
</header>
<div id="outline-container-orgd34e606" class="outline-2">
<h2 id="orgd34e606">Sources</h2>
<div class="outline-text-2" id="text-orgd34e606">
<ul class="org-ul">
<li><a href="https://benwindsorcode.github.io/Getting-Started-With-Emacs-Lisp/">Getting Started With Emacs Lisp Hands On - A Practical Beginners Tutorial (#1)</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/List-Processing.html#List-Processing">List Processing - GNU (#2)</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Writing-Defuns.html#Writing-Defuns">How To Write Function Definitions (#3)</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Practicing-Evaluation.html#Practicing-Evaluation">Practicing Evaluation (#4)</a> - Getting and switching buffers</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/car-cdr-_0026-cons.html#car-cdr-_0026-cons">Fundamental Functions (#5)</a> - List operations</li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/Loops-_0026-Recursion.html#Loops-_0026-Recursion">Loops and Recursion (#6)</a></li>
<li><a href="https://www.masteringemacs.org/article/mastering-key-bindings-emacs">Mastering Key Bindings in Emacs (#7)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb7c59ba" class="outline-2">
<h2 id="orgb7c59ba">Notes from source #1</h2>
<div class="outline-text-2" id="text-orgb7c59ba">
<p>
Emacs Lisp is a programming language used for interacting, customising and extending Emacs functionality.
</p>

<hr>
</div>

<div id="outline-container-orgb91bc29" class="outline-3">
<h3 id="orgb91bc29">Running Elisp in a buffer</h3>
<div class="outline-text-3" id="text-orgb91bc29">
<p>
In empty buffers, Elisp can be written and executed by placing the cursor over the end of a line and typing <code>C-x C-e</code>:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Adding two numbers with reverse polish notation</label><pre class="src src-elisp" id="orgfc5c915">(+ 2 2)
</pre>
</div>

<p>
This will result in:
</p>

<p>
ELisp, and other Lisp dialects, often use Reverse Polish Notation (RPN) where the operator is specified before the operands rather than between.
</p>

<p>
Functions can also be called by surrounding them with parenthesis and making them the first element:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>The describe-bindings function</label><pre class="src src-elisp" id="org12fe7ac">(describe-bindings)
</pre>
</div>

<p>
The <code>describe-bindings</code> function outputs a help buffer with a list of key bindings.
</p>

<ul class="org-ul">
<li>Note: If in a org file, run with <code>C-c C-c</code> instead</li>
</ul>
</div>
</div>

<div id="outline-container-orgca706d9" class="outline-3">
<h3 id="orgca706d9">Flow control (if statement)</h3>
<div class="outline-text-3" id="text-orgca706d9">
<p>
The if/else statement has the following structure:
</p>

<p>
#+caption if-else statement example
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">if</span> (condition)
    (execute if true)
    (execute if false))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2924edc" class="outline-3">
<h3 id="org2924edc">Get current line number</h3>
<div class="outline-text-3" id="text-org2924edc">
<p>
Use <code>what-line</code> to get the line number of the cursors position:
</p>

<p>
#+caption what-line examples
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="orgfc160c6">(<span style="font-weight: bold;">if</span> (eq (what-line) <span style="font-style: italic;">"Line 1"</span>)
    (princ <span style="font-style: italic;">"Is line 1"</span>)
    (princ <span style="font-style: italic;">"Not line 1"</span>))
</pre>
</div>

<p>
The output of this is as follows:
</p>

<pre class="example">
Not line 1

</pre>

<p>
The <code>princ</code> function will print a string to standard output, the <code>eq</code> function returns true if two inputs are equal, false otherwise.
</p>
</div>
</div>

<div id="outline-container-org016fd87" class="outline-3">
<h3 id="org016fd87">Writing functions</h3>
<div class="outline-text-3" id="text-org016fd87">
<p>
The <code>defun</code> keyword is used to define a function:
</p>

<p>
#+caption function declaration example
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">function-name</span> (parameter1 parameter2 etc...)
    (body))
</pre>
</div>

<p>
The code to execute is placed in the body, inputs are passed as parameters.
</p>

<p>
The following example is a function definition for adding two numbers:
</p>

<p>
#+caption A function to add two numbers
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="org9f39af9">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">add-numbers</span> (num1 num2)
    (+ num1 num2))
</pre>
</div>

<p>
This can then be invoked like so:
</p>

<p>
#+caption Invoking the add-numbers function
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="org7dd2935">(add-numbers 3 2)
</pre>
</div>

<p>
This outputs the result:
</p>

<pre class="example">
5

</pre>
</div>
</div>

<div id="outline-container-org7515c5d" class="outline-3">
<h3 id="org7515c5d">Interacting with emacs</h3>
<div class="outline-text-3" id="text-org7515c5d">
</div>
<div id="outline-container-org5d04a98" class="outline-4">
<h4 id="org5d04a98">Moving around the buffer</h4>
<div class="outline-text-4" id="text-org5d04a98">
<p>
The <code>search-forward</code> function accepts a string to search for in some text, this will jump the cursor to the line with the first match on it, ~search-backward does the reverse.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(search-forward <span style="font-style: italic;">"hello"</span>)
some text
hello
</pre>
</div>

<p>
The <code>goto-char</code> function accepts a character number to jump the cursor to:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(goto-char 0)
</pre>
</div>

<p>
Pass the <code>point-max</code> function to get the number of the last character in the document and jump to it:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(goto-char (point-max))
</pre>
</div>

<p>
Use <code>point-min</code> for the first character:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(goto-char (point-min))
</pre>
</div>

<p>
The <code>next-line</code> and <code>previous-line</code> functions are used for moving the cursor forwards or backwards one line respectively.
</p>
</div>
</div>

<div id="outline-container-org1dd1c97" class="outline-4">
<h4 id="org1dd1c97">Inserting text</h4>
<div class="outline-text-4" id="text-org1dd1c97">
<p>
Insert text into a buffer with the <code>insert</code> function followed by either:
</p>

<ul class="org-ul">
<li>a string</li>
<li>a set of space separated strings and string variables</li>
</ul>

<p>
Inserting text looks as follows:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orged45140">(next-line)
(next-line)
(insert <span style="font-style: italic;">"This text was inserted :D"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4823c92" class="outline-4">
<h4 id="org4823c92">Moving the cursor back to where it started</h4>
<div class="outline-text-4" id="text-org4823c92">
<p>
After moving the cursor, it is often desirable to return it to where it started. The <code>save-excursion</code> function can be used to wrap Elisp statements that may modify the cursors position and return it to its original position:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">save-excursion</span>
    (previous-line)
    (insert <span style="font-style: italic;">"Inserted this above ya"</span>)) 
</pre>
</div>
</div>
</div>
</div>
