org/blog/Emacs_Lisp/basics.org
*** Exposing functions to Emacs

To make functions callable from within Emacs via ~M-x~, use the ~interactive~ keyword in a function:

#+name: greet-function
#+begin_src elisp :results silent :exports code :eval yes :session basics
  (defun greet (name)
      "This function prints a Hello <name> greeting to stdout."
      (interactive "MName:")
      (princ name))
#+end_src

When called, this will output:

#+name: greet-call
#+begin_src elisp :results output :exports both :eval yes :session basics
  (greet "Morgan")
#+end_src

This will output:

#+results: greet-call
: Morgan

The string passed to ~interactive~ accepts special character codes followed by text to display in the buffer. The following function will insert a name at the end of the document if called using ~M-x~:

#+name: insert-name-at-end
#+begin_src elisp :results silent :exports code :eval no-export
  (defun insert-name-at-end (name)
      "This function inserts a name at the end of the document."
      (interactive "MName:")
      (goto-char (point-max))
      (insert name))
#+end_src

When ~interactive~ is used, it will supply parameters in the order they appear from the prompts as they appear. Use the newline, ~\n~ character to supply multiple parameters:

#+name: insert-info-at-end
#+begin_src elisp :results silent :exports code :eval no-export
  (defun insert-info-at-end (name age)
      "This function inserts a name at the end of the document."
      (interactive "MName:\nMAge")
      (goto-char (point-max))
      (insert name " is aged " age))
#+end_src

Many character codes exist that can be used in the special string supplied to ~interactive~: [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html][Interactive Codes - GNU]]

*** Adding key bindings

The ~global-set-key~ function can be used to bind keyboard shortcuts to functions:

#+begin_src elisp :results silent :exports code :eval no-export
  (global-set-key (kbd "C-c C-c") 'org-capture)
#+end_src

This will bind the keyboard key sequence to the ~org-capture~ function globally. To bind only to a specific mode, use the ~define-key~ function and pass it a mode's key map by taking the name of a mode and appending ~-map~ to it to get the object that the specified mode stores its key bindings in.

The following example sets ~org-capture~ to only be a key binding when already in org mode:

#+begin_src elisp :results silent :exports code :eval no-export
  (global-set-key (kbd "C-c C-c") 'org-capture)
#+end_src

- Hint: Global is better for this, be a bit of a pain to keep having to switch to org mode before capturing

** Notes from source #2

*** Lisp lists

A list in Lisp is preceeded by a single apostrophe followed by a set of parenthesis containing elements separated by white space:

#+name: simple-list
#+begin_src elisp :results silent :exports code :eval no-export
  '(this is a list of strings)
#+end_src

**** Numbers, Lists inside of Lists

Lists can have numbers in them as well as strings. Lisp represents both data and programs in the same way, using lists of words, numbers, or other lists, separated by whitespace and surrounded with parentheses.

#+name: nested-list
#+begin_src elisp :results silent :exports code :eval no-export
  '("this is" ("nested"))
#+end_src

**** Lisp Atoms

Lisp refers to the words in lists as *atoms*, meaning these elements cannot be divided any further than they already are - a list on the other hand can be split into parts.

Atoms are separated by whitespace in lists, but can be touching outer parentheses.

A list can have no atoms in it, ~()~, which is known as the *empty list*. Unlike anything else in Lisp, empty lists can be considered both an atom and a list at the same time.

- Atoms and lists are called *symbolic expressions* / *s-expressions*, the word /expression/ can refer to either the printed representation, or to the atom or list as is held by the computer internally.
- /form/ is often used as a synonym for expression
- a string inside quotation marks is considered an atom

*** Run a program

A list, without a quotation mark before it, is a ready to run program which can be /evaluated/. The computer does one of three things:

- return the list itself
- send an error message
- treat the first symbol in the list as a command

The *quote*, a single apostrophe before a list, is used to tell Lisp to do nothing with the list. If no quote precedes a list, Lisp will treat the first symbol as a function to execute.

Lisp can also evaluate atoms that are not part of a list as well.

*** Symbol Names and Function Definitions

The first symbol in a list, such as ~+~, acts as a way to locate the definition/set of instructions associated with it.

- A symbol may only have one definition

It is customary in Emacs Lisp to name symbols in a way that identifies which part of Emacs the function belongs to. For example, commands for reading mail start with ~rmail-~.

*** The Lisp Interpreter

The Lisp interpreter will return a list if there is a quote before, or look at the first element in the list to see if it is a function definition to carry out if no quote is before the list.

**** Complications

*Complication 1*: The Lisp interpreter can evaluate symbols which are not quoted, nor with parentheses around them. The interpeter attempts to determine the symbol's value as a /variable/.

*Complication 2*: Some functions are unusual and don't work in the usual way, these are known as *special forms* and are used for special jobs like defining a function.

*Macros* are another construct alongside special forms, macros translate a Lisp expression into another expression to be evaluated in place of the original expression.

- ~if~ is a special form, ~when~ is a macro, ~defun~ was a special form in early versions of Emacs, but is a macro in later versions

*Complication 3*: If the function a Lisp interpreter is looking at is not a special form and is part of a list, the Lisp interpreter looks to see if there is a nested list. If there is, the interpreter figures out what to do with the nested list and then works on the outer list.

If no nested lists are present in a list, the interpreter works from left to right, one expression to the next.

*** Evaluation

*Evaluation* is the process through which the Lisp interpreter executes an expression.

-------------------------

