blog/Emacs_Lisp/basics.html

<div id="outline-container-orga988e8b" class="outline-3">
<h3 id="orga988e8b">Exposing functions to Emacs</h3>
<div class="outline-text-3" id="text-orga988e8b">
<p>
To make functions callable from within Emacs via <code>M-x</code>, use the <code>interactive</code> keyword in a function:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org59c9aca">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">greet</span> (name)
    <span style="font-style: italic;">"This function prints a Hello &lt;name&gt; greeting to stdout."</span>
    (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"MName:"</span>)
    (princ name))
</pre>
</div>

<p>
When called, this will output:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgb8c13de">(greet <span style="font-style: italic;">"Morgan"</span>)
</pre>
</div>

<p>
This will output:
</p>

<pre class="example">
Morgan

</pre>

<p>
The string passed to <code>interactive</code> accepts special character codes followed by text to display in the buffer. The following function will insert a name at the end of the document if called using <code>M-x</code>:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org8498cef">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">insert-name-at-end</span> (name)
    <span style="font-style: italic;">"This function inserts a name at the end of the document."</span>
    (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"MName:"</span>)
    (goto-char (point-max))
    (insert name))
</pre>
</div>

<p>
When <code>interactive</code> is used, it will supply parameters in the order they appear from the prompts as they appear. Use the newline, <code>\n</code> character to supply multiple parameters:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org0a56e7a">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">insert-info-at-end</span> (name age)
    <span style="font-style: italic;">"This function inserts a name at the end of the document."</span>
    (<span style="font-weight: bold;">interactive</span> <span style="font-style: italic;">"MName:\nMAge"</span>)
    (goto-char (point-max))
    (insert name <span style="font-style: italic;">" is aged "</span> age))
</pre>
</div>

<p>
Many character codes exist that can be used in the special string supplied to <code>interactive</code>: <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Interactive-Codes.html">Interactive Codes - GNU</a>
</p>
</div>
</div>

<div id="outline-container-org6c8b45d" class="outline-3">
<h3 id="org6c8b45d">Adding key bindings</h3>
<div class="outline-text-3" id="text-org6c8b45d">
<p>
The <code>global-set-key</code> function can be used to bind keyboard shortcuts to functions:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="font-style: italic;">"C-c C-c"</span>) 'org-capture)
</pre>
</div>

<p>
This will bind the keyboard key sequence to the <code>org-capture</code> function globally. To bind only to a specific mode, use the <code>define-key</code> function and pass it a mode's key map by taking the name of a mode and appending <code>-map</code> to it to get the object that the specified mode stores its key bindings in.
</p>

<p>
The following example sets <code>org-capture</code> to only be a key binding when already in org mode:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd <span style="font-style: italic;">"C-c C-c"</span>) 'org-capture)
</pre>
</div>

<ul class="org-ul">
<li>Hint: Global is better for this, be a bit of a pain to keep having to switch to org mode before capturing</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org71c71b2" class="outline-2">
<h2 id="org71c71b2">Notes from source #2</h2>
<div class="outline-text-2" id="text-org71c71b2">
</div>
<div id="outline-container-org3ca4ea0" class="outline-3">
<h3 id="org3ca4ea0">Lisp lists</h3>
<div class="outline-text-3" id="text-org3ca4ea0">
<p>
A list in Lisp is preceeded by a single apostrophe followed by a set of parenthesis containing elements separated by white space:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org3224eca">'(this is a list of strings)
</pre>
</div>
</div>

<div id="outline-container-org9f8d884" class="outline-4">
<h4 id="org9f8d884">Numbers, Lists inside of Lists</h4>
<div class="outline-text-4" id="text-org9f8d884">
<p>
Lists can have numbers in them as well as strings. Lisp represents both data and programs in the same way, using lists of words, numbers, or other lists, separated by whitespace and surrounded with parentheses.
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org12589b3">'(<span style="font-style: italic;">"this is"</span> (<span style="font-style: italic;">"nested"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae4b76c" class="outline-4">
<h4 id="orgae4b76c">Lisp Atoms</h4>
<div class="outline-text-4" id="text-orgae4b76c">
<p>
Lisp refers to the words in lists as <b>atoms</b>, meaning these elements cannot be divided any further than they already are - a list on the other hand can be split into parts.
</p>

<p>
Atoms are separated by whitespace in lists, but can be touching outer parentheses.
</p>

<p>
A list can have no atoms in it, <code>()</code>, which is known as the <b>empty list</b>. Unlike anything else in Lisp, empty lists can be considered both an atom and a list at the same time.
</p>

<ul class="org-ul">
<li>Atoms and lists are called <b>symbolic expressions</b> / <b>s-expressions</b>, the word <i>expression</i> can refer to either the printed representation, or to the atom or list as is held by the computer internally.</li>
<li><i>form</i> is often used as a synonym for expression</li>
<li>a string inside quotation marks is considered an atom</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgea60022" class="outline-3">
<h3 id="orgea60022">Run a program</h3>
<div class="outline-text-3" id="text-orgea60022">
<p>
A list, without a quotation mark before it, is a ready to run program which can be <i>evaluated</i>. The computer does one of three things:
</p>

<ul class="org-ul">
<li>return the list itself</li>
<li>send an error message</li>
<li>treat the first symbol in the list as a command</li>
</ul>

<p>
The <b>quote</b>, a single apostrophe before a list, is used to tell Lisp to do nothing with the list. If no quote precedes a list, Lisp will treat the first symbol as a function to execute.
</p>

<p>
Lisp can also evaluate atoms that are not part of a list as well.
</p>
</div>
</div>

<div id="outline-container-orgc482a14" class="outline-3">
<h3 id="orgc482a14">Symbol Names and Function Definitions</h3>
<div class="outline-text-3" id="text-orgc482a14">
<p>
The first symbol in a list, such as <code>+</code>, acts as a way to locate the definition/set of instructions associated with it.
</p>

<ul class="org-ul">
<li>A symbol may only have one definition</li>
</ul>

<p>
It is customary in Emacs Lisp to name symbols in a way that identifies which part of Emacs the function belongs to. For example, commands for reading mail start with <code>rmail-</code>.
</p>
</div>
</div>

<div id="outline-container-org5ccbeeb" class="outline-3">
<h3 id="org5ccbeeb">The Lisp Interpreter</h3>
<div class="outline-text-3" id="text-org5ccbeeb">
<p>
The Lisp interpreter will return a list if there is a quote before, or look at the first element in the list to see if it is a function definition to carry out if no quote is before the list.
</p>
</div>

<div id="outline-container-org04f3fbd" class="outline-4">
<h4 id="org04f3fbd">Complications</h4>
<div class="outline-text-4" id="text-org04f3fbd">
<p>
<b>Complication 1</b>: The Lisp interpreter can evaluate symbols which are not quoted, nor with parentheses around them. The interpeter attempts to determine the symbol's value as a <i>variable</i>.
</p>

<p>
<b>Complication 2</b>: Some functions are unusual and don't work in the usual way, these are known as <b>special forms</b> and are used for special jobs like defining a function.
</p>

<p>
<b>Macros</b> are another construct alongside special forms, macros translate a Lisp expression into another expression to be evaluated in place of the original expression.
</p>

<ul class="org-ul">
<li><code>if</code> is a special form, <code>when</code> is a macro, <code>defun</code> was a special form in early versions of Emacs, but is a macro in later versions</li>
</ul>

<p>
<b>Complication 3</b>: If the function a Lisp interpreter is looking at is not a special form and is part of a list, the Lisp interpreter looks to see if there is a nested list. If there is, the interpreter figures out what to do with the nested list and then works on the outer list.
</p>

<p>
If no nested lists are present in a list, the interpreter works from left to right, one expression to the next.
</p>
</div>
</div>
</div>

<div id="outline-container-orga38936b" class="outline-3">
<h3 id="orga38936b">Evaluation</h3>
<div class="outline-text-3" id="text-orga38936b">
<p>
<b>Evaluation</b> is the process through which the Lisp interpreter executes an expression.
</p>

<hr>
</div>
