org/blog/Emacs_Lisp/basics.org
**** How the Lisp Interpreter Acts

In most normal circumstances, the Lisp interpreter returns a value produced by evaluating an expression. It may also produce instead:

- error messages
- an infinite loop
- etc...

As well as returning a value, a *side effect* may occur such as moving the cursor or copying a file.

#+caption: https://www.gnu.org/software/emacs/manual/html_node/eintr/How-the-Interpreter-Acts.html
#+begin_quote
In summary, evaluating a symbolic expression most commonly causes the Lisp interpreter to return a value and perhaps carry out a side effect; or else produce an error. 
#+end_quote

**** Evaluating inner lists

When a inner list is present, the value returned by it can be used as information when the outer list is evaluated - this is why inner expressions are evaluated before outer expressions:

#+name: simple-math
#+begin_src elisp :results value :exports both :eval yes
  (+ 2 (* 3 3))
#+end_src

Running this s-expression will result in the inner expression, ~3 * 3~, being executed first with its result passed to the addition operation resulting in the value of:

#+results: simple-math
: 11

When ~C-x C-e~ is ran, it executes ~eval-last-sexp~ to evaluate the last symbol expression.

- ~sexp~ abbreviates symbol expression
- ~eval~ is an abbreviation for evaluate

  
*** Variables

A symbol can have a value attached to instead of a function definition as well. The value of a symbol can be any expression in Lisp, such as a symbol, number, list or string.

- A symbol may have both a function definition and a value attached to it at the same time, or just one or the other.

**** Setting the value of a variable

[[https://www.gnu.org/software/emacs/manual/html_node/eintr/set-_0026-setq.html]]

The function ~set~ or the special form ~setq~ can be used to set variables, ~let~ can also be used. This process is known as a binding a variable to a value.

***** Using ~set~

To set a variable, write ~set~ followed by two quoted arguments unless you want the symbol name and its value to be evaluated:

#+name: set-example
#+begin_src elisp :results output :exports both :eval yes
  (set 'ingredients '(rice chicken eggs peppers))
  (set 'name 'fred)

  (princ ingredients)
  (princ "\n")
  (princ name)
#+end_src

This would output:

#+RESULTS: set-example
: (rice chicken eggs peppers)
: fred

***** Using ~setq~

With ~set~, the first argument must almost alway be quoted unless it evaluates to a string. The special form ~setq~ is designed to handle the common combination of ~set~ and a quoted first argument - ~setq~ quotes the first argument automatically :)

~setq~ can also be used to set several variables in one expression:

#+name: setq-example
#+begin_src elisp :results output :exports both :eval yes
  (setq name 'Morgan)
  (setq age '23
        likes 'Pizza)

  (princ "Name: ")
  (princ name)
  (princ "\n")
  (princ "Age: ")5
  (princ age)
#+end_src

This would output:

#+RESULTS: setq-example
: Name: Morgan
: Age: 23

*** Arguments

Inputs passed to a function are known as its *arguments*, these arguments are atoms or lists and the values returned (outputs) may also be atoms or lists.

**** Arguments' Data Types

The type of data passed to a function matter, ~+~ for example requires numbers.

~concat~ is used to link two or more strings of text together:

#+name: concat example
#+begin_src elisp :results value :exports both :eval yes
  (setq name "Bob")
  (concat "Hello " name)
#+end_src

This will concatenate the two strings together:

#+RESULTS: concat example
: Hello Bob

~substring~ accepts a string and numbers as input, returning a substring of its first argument:

- the first argument takes a string
- the second and third take numbers indicating the beginning (inclusive) and end (exclusive) of the substring

For example:

#+name: substring-example
#+begin_src elisp :results value :exports both :eval yes
  (substring "Morgan" 0 4)
#+end_src

would output:

#+RESULTS: substring-example
: Morg

It is important to remember that computers are zero-based in most forms of counting, this includes the positions of characters in a string.

**** An argument as the Value of a Variable or List

Arguments can also be symbols that return values when evaluated. Arguments can also be a list that returns a value when it is evaluated. The following example demonstrates using a list as input to the ~concat~ function:

#+name: list-as-argument-example
#+begin_src elisp :results value :exports both :eval yes
  (defun author ()
      "Morgan Walsh")

  (defun age ()
      (23))

  (concat "Written by " (author) ", aged " (number-to-string age) ".")
#+end_src

In this block, we specify two lists which make calls to functions. Below is the output:

#+RESULTS: list-as-argument-example
: Written by Morgan Walsh, aged 23.

**** Variable Number of Arguments

Some functions can take a variable number of arguments, ~concat~, ~+~, and ~*~ being some of them.

**** The ~message~ function

The ~message~ function takes a variable number of arguments and sends messages in the echo area:

#+name: message-example
#+begin_src elisp :results value :exports both :eval yes
  (message "Hello reader")
#+end_src

This will output:

#+RESULTS: message-example
: Hello reader

A format specifier can be specified to insert arguments into a string:

#+name: format-specifier-example
#+begin_src elisp :results value :exports both :eval yes
  (setq name "Morgan")
  (message "Hello %s" name)
#+end_src

This will output:

#+RESULTS: format-specifier-example
: Hello Morgan

The ~%s~ specifier can be used to print numbers as well, ~%d~ will only print numbers left of the decimal point (whole numbers).
