blog/Emacs_Lisp/basics.html

<div id="outline-container-orgeb25c5c" class="outline-4">
<h4 id="orgeb25c5c">How the Lisp Interpreter Acts</h4>
<div class="outline-text-4" id="text-orgeb25c5c">
<p>
In most normal circumstances, the Lisp interpreter returns a value produced by evaluating an expression. It may also produce instead:
</p>

<ul class="org-ul">
<li>error messages</li>
<li>an infinite loop</li>
<li>etc&#x2026;</li>
</ul>

<p>
As well as returning a value, a <b>side effect</b> may occur such as moving the cursor or copying a file.
</p>

<blockquote>
<p>
In summary, evaluating a symbolic expression most commonly causes the Lisp interpreter to return a value and perhaps carry out a side effect; or else produce an error. 
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org475d35e" class="outline-4">
<h4 id="org475d35e">Evaluating inner lists</h4>
<div class="outline-text-4" id="text-org475d35e">
<p>
When a inner list is present, the value returned by it can be used as information when the outer list is evaluated - this is why inner expressions are evaluated before outer expressions:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org3ea863d">(+ 2 (* 3 3))
</pre>
</div>

<p>
Running this s-expression will result in the inner expression, <code>3 * 3</code>, being executed first with its result passed to the addition operation resulting in the value of:
</p>

<pre class="example">
11

</pre>

<p>
When <code>C-x C-e</code> is ran, it executes <code>eval-last-sexp</code> to evaluate the last symbol expression.
</p>

<ul class="org-ul">
<li><code>sexp</code> abbreviates symbol expression</li>
<li><code>eval</code> is an abbreviation for evaluate</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgfb0f812" class="outline-3">
<h3 id="orgfb0f812">Variables</h3>
<div class="outline-text-3" id="text-orgfb0f812">
<p>
A symbol can have a value attached to instead of a function definition as well. The value of a symbol can be any expression in Lisp, such as a symbol, number, list or string.
</p>

<ul class="org-ul">
<li>A symbol may have both a function definition and a value attached to it at the same time, or just one or the other.</li>
</ul>
</div>

<div id="outline-container-org4885c10" class="outline-4">
<h4 id="org4885c10">Setting the value of a variable</h4>
<div class="outline-text-4" id="text-org4885c10">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/set-_0026-setq.html">https://www.gnu.org/software/emacs/manual/html_node/eintr/set-_0026-setq.html</a>
</p>

<p>
The function <code>set</code> or the special form <code>setq</code> can be used to set variables, <code>let</code> can also be used. This process is known as a binding a variable to a value.
</p>
</div>

<div id="outline-container-org0b23b75" class="outline-5">
<h5 id="org0b23b75">Using <code>set</code></h5>
<div class="outline-text-5" id="text-org0b23b75">
<p>
To set a variable, write <code>set</code> followed by two quoted arguments unless you want the symbol name and its value to be evaluated:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org3644e20">(set 'ingredients '(rice chicken eggs peppers))
(set 'name 'fred)

(princ ingredients)
(princ <span style="font-style: italic;">"\n"</span>)
(princ name)
</pre>
</div>

<p>
This would output:
</p>

<pre class="example">
(rice chicken eggs peppers)
fred

</pre>
</div>
</div>

<div id="outline-container-orgbe7a814" class="outline-5">
<h5 id="orgbe7a814">Using <code>setq</code></h5>
<div class="outline-text-5" id="text-orgbe7a814">
<p>
With <code>set</code>, the first argument must almost alway be quoted unless it evaluates to a string. The special form <code>setq</code> is designed to handle the common combination of <code>set</code> and a quoted first argument - <code>setq</code> quotes the first argument automatically :)
</p>

<p>
<code>setq</code> can also be used to set several variables in one expression:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org2fe5dfa">(<span style="font-weight: bold;">setq</span> name 'Morgan)
(<span style="font-weight: bold;">setq</span> age '23
      likes 'Pizza)

(princ <span style="font-style: italic;">"Name: "</span>)
(princ name)
(princ <span style="font-style: italic;">"\n"</span>)
(princ <span style="font-style: italic;">"Age: "</span>)5
(princ age)
</pre>
</div>

<p>
This would output:
</p>

<pre class="example">
Name: Morgan
Age: 23

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org60128d5" class="outline-3">
<h3 id="org60128d5">Arguments</h3>
<div class="outline-text-3" id="text-org60128d5">
<p>
Inputs passed to a function are known as its <b>arguments</b>, these arguments are atoms or lists and the values returned (outputs) may also be atoms or lists.
</p>
</div>

<div id="outline-container-org810341b" class="outline-4">
<h4 id="org810341b">Arguments' Data Types</h4>
<div class="outline-text-4" id="text-org810341b">
<p>
The type of data passed to a function matter, <code>+</code> for example requires numbers.
</p>

<p>
<code>concat</code> is used to link two or more strings of text together:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgcb38b6b">(<span style="font-weight: bold;">setq</span> name <span style="font-style: italic;">"Bob"</span>)
(concat <span style="font-style: italic;">"Hello "</span> name)
</pre>
</div>

<p>
This will concatenate the two strings together:
</p>

<pre class="example">
Hello Bob

</pre>

<p>
<code>substring</code> accepts a string and numbers as input, returning a substring of its first argument:
</p>

<ul class="org-ul">
<li>the first argument takes a string</li>
<li>the second and third take numbers indicating the beginning (inclusive) and end (exclusive) of the substring</li>
</ul>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org8e8678c">(substring <span style="font-style: italic;">"Morgan"</span> 0 4)
</pre>
</div>

<p>
would output:
</p>

<pre class="example">
Morg

</pre>

<p>
It is important to remember that computers are zero-based in most forms of counting, this includes the positions of characters in a string.
</p>
</div>
</div>

<div id="outline-container-org4526b05" class="outline-4">
<h4 id="org4526b05">An argument as the Value of a Variable or List</h4>
<div class="outline-text-4" id="text-org4526b05">
<p>
Arguments can also be symbols that return values when evaluated. Arguments can also be a list that returns a value when it is evaluated. The following example demonstrates using a list as input to the <code>concat</code> function:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org0a0ba01">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">author</span> ()
    <span style="font-style: italic;">"Morgan Walsh"</span>)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">age</span> ()
    (23))

(concat <span style="font-style: italic;">"Written by "</span> (author) <span style="font-style: italic;">", aged "</span> (number-to-string age) <span style="font-style: italic;">"."</span>)
</pre>
</div>

<p>
In this block, we specify two lists which make calls to functions. Below is the output:
</p>

<pre class="example">
Written by Morgan Walsh, aged 23.

</pre>
</div>
</div>

<div id="outline-container-orgd5acf92" class="outline-4">
<h4 id="orgd5acf92">Variable Number of Arguments</h4>
<div class="outline-text-4" id="text-orgd5acf92">
<p>
Some functions can take a variable number of arguments, <code>concat</code>, <code>+</code>, and <code>*</code> being some of them.
</p>
</div>
</div>

<div id="outline-container-orgae62ea6" class="outline-4">
<h4 id="orgae62ea6">The <code>message</code> function</h4>
<div class="outline-text-4" id="text-orgae62ea6">
<p>
The <code>message</code> function takes a variable number of arguments and sends messages in the echo area:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgf948dac">(message <span style="font-style: italic;">"Hello reader"</span>)
</pre>
</div>

<p>
This will output:
</p>

<pre class="example">
Hello reader

</pre>

<p>
A format specifier can be specified to insert arguments into a string:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="org1758755">(<span style="font-weight: bold;">setq</span> name <span style="font-style: italic;">"Morgan"</span>)
(message <span style="font-style: italic;">"Hello %s"</span> name)
</pre>
</div>

<p>
This will output:
</p>

<pre class="example">
Hello Morgan

</pre>

<p>
The <code>%s</code> specifier can be used to print numbers as well, <code>%d</code> will only print numbers left of the decimal point (whole numbers).
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <small>
    Copyright 2022 Morgan Walsh.<br />
    Last updated 2022-05-19 Thu 23:13. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </small>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
